[
  {
    "id": "1",
    "page_heading": "UnrealPays – Global HR Recruitment Platform",
    "page_subheading": "UnrealPays – Global HR Recruitment Platform",
    "client_name": "Nexnology Pvt",
    "project_date": "January 2022",
    "category": "Website Development",
    "location": "24 Fifth st.,Los Angeles, USA",
    "project_description": "UnrealPays is a dynamic HR recruitment solution designed to simplify hiring and job hunting worldwide. It serves as a centralized platform where HR professionals, companies, managers, and job seekers can interact efficiently. From profile creation to job applications and company discovery, UnrealPays brings transparency, credibility, and ease to the hiring process.",
    "challenge_description": "The client needed a multifunctional HR platform that could serve both companies and employees on a global scale. The challenge was to create a seamless user experience that allowed different roles (HRs, employers, employees, and managers) to interact, manage profiles, and track job applications—while ensuring trust with verified users and global search functionality.",
    "challenge_point_1": "Complex multi-role management (HRs, employees, employers)",
    "challenge_point_2": "Paid verification system with blue tick for trusted profiles",
    "challenge_point_3": "Global job search and filters with smart resume tools",
    "solution_description": "I developed a robust, PHP-based platform with full profile management, LinkedIn login, and resume builder integration via mobile. Verified users and companies are marked with a blue tick, increasing trust. Companies and job seekers can connect, apply, and hire more efficiently with in-depth profile search, credibility scores, and direct messaging features.",
    "image_main": "prot-detailsbig.png",
    "image_extra_1": "prot-detials1.png",
    "image_extra_2": "prot-detials2.png"
  },
  {
    "id": "2",
    "page_heading": "FastAuth – Secure Payment & Checkout Solution",
    "page_subheading": "FastAuth – Secure Payment & Checkout Solution",
    "client_name": "Nexnology Pvt",
    "project_date": "July 2022",
    "category": "Website Development",
    "location": "24 Fifth st.,Los Angeles, USA",
    "project_description": "FastAuth is a high-performance login and guest checkout solution built to help online businesses boost conversions and streamline the user experience. I was responsible for developing the complete frontend and backend functionality using HTML, CSS, JavaScript, PHP, Git, and Bootstrap, ensuring secure login, registration, and password recovery systems with email verification.",
    "challenge_description": "The client required a secure and conversion-optimized login and guest checkout experience that supports both business and personal users. The key challenge was to create a seamless flow for demo bookings, secure email logins, and plan-based access — all while maintaining industry-level data protection standards.",
    "challenge_point_1": "Business and standard email support with clean UI",
    "challenge_point_2": "Password reset via secure email delivery",
    "challenge_point_3": "Plans-based access control with dashboard redirection",
    "solution_description": "I developed a fully responsive frontend and core PHP system that allows users to register, log in, reset passwords, and book demo calls. The system securely handles user data and is designed to integrate with third-party platforms. While the dashboard was developed by another team using React, I ensured compatibility and could replicate it if required.",
    "image_main": "prot-detailsbig-fastauth.png",
    "image_extra_1": "prot-detials1-fastauth.png",
    "image_extra_2": "prot-detials2-fastauth.png"
  },
  {
    "id": "3",
    "page_heading": "OptimusDevs – IT Software Development Company Site",
    "page_subheading": "Corporate site for a full-service tech agency",
    "client_name": "OptimusDevs",
    "project_date": "Not Provided",
    "category": "Website Development",
    "location": "Not Provided",
    "project_description": "OptimusDevs is a corporate website built for a full-service technology agency. The platform was designed to showcase the company's wide range of offerings, providing an engaging and professional digital presence.",
    "challenge_description": "The client needed a clean, service-driven layout that could effectively showcase diverse offerings while maintaining strong performance and optimized content delivery.",
    "challenge_point_1": "Built a clean, service-driven layout for diverse offerings",
    "challenge_point_2": "Focused on performance and fast content delivery",
    "challenge_point_3": "Needed scalable and SEO-friendly design system",
    "solution_description": "I created a scalable and SEO-optimized corporate site that highlights all services including SEO, development, editing, SMM, and AWS hosting. The site includes integrated contact forms for lead capture and inquiries, ensuring a professional and conversion-focused design system.",
    "image_main": "optimusdevs-main.png",
    "image_extra_1": "optimusdevs-extra1.png",
    "image_extra_2": "optimusdevs-extra2.png"
  },
  {
    "id": "4",
    "page_heading": "BookAReview Website – Shopify Review Automation Tool",
    "page_subheading": "BookAReview – Official Marketing Site for AI-Powered Shopify Review App",
    "client_name": "BookAReview",
    "project_date": "Not Provided",
    "category": "Website Development",
    "location": "Not Provided",
    "project_description": "I designed and developed the official marketing website for BookAReview, an AI-powered Shopify review automation app. The site highlights key features such as AI-crafted personalized messages, performance insights, Shopify integration, and customer trust-building. Built using HTML, CSS, Tailwind, Bootstrap, PHP (Laravel), and JavaScript, the site delivers a fast, responsive, SEO-optimized experience with lead capture and clear product storytelling.",
    "challenge_description": "The challenge was to create a modern, high-performing marketing site that communicates the app’s benefits clearly, engages potential Shopify users, and drives conversions while being SEO-friendly and responsive.",
    "challenge_point_1": "Communicate app’s AI-powered features and benefits effectively",
    "challenge_point_2": "Ensure fast performance, SEO optimization, and responsiveness",
    "challenge_point_3": "Integrate lead capture and highlight trust-building elements",
    "solution_description": "I built a responsive and scalable marketing site tailored for Shopify merchants. The design focuses on product storytelling with clear feature highlights, optimized SEO, and strong performance. Lead capture forms and trust-focused UI elements help convert visitors into customers, while maintaining a clean, modern design language.",
    "image_main": "bookareview-main.png",
    "image_extra_1": "bookareview-extra1.png",
    "image_extra_2": "bookareview-extra2.png"
  },
  {
    "id": "5",
    "page_heading": "BlueOlive’s .DEV – AI-Powered No-Code Website & App Builder",
    "page_subheading": "AI-Powered No-Code Builder for Websites, Shopify, and Mobile Apps",
    "client_name": "BlueOlive",
    "project_date": "Not Provided",
    "category": "Website & App Development",
    "location": "Not Provided",
    "project_description": "BlueOlive’s .DEV is an AI-powered no-code website and app builder designed for websites, Shopify, and mobile apps. The platform enables 20x faster development with a responsive UI editor, prompt-based code generation, and the built-in .DEV assistant to launch MVPs in under a day. I worked on both frontend and backend using HTML, CSS, JavaScript, Tailwind, Bootstrap, PHP, Laravel, MySQL, and MongoDB to deliver a seamless and dynamic user experience.",
    "challenge_description": "The client needed a powerful no-code platform that could help users create websites, Shopify stores, and mobile apps quickly without technical expertise. The challenge was to integrate AI-driven features like prompt-based code generation and responsive UI editing while ensuring scalability and smooth performance.",
    "challenge_point_1": "AI-powered no-code system for websites, Shopify, and apps",
    "challenge_point_2": "Responsive UI editor with seamless editing experience",
    "challenge_point_3": "Prompt-based code generation with integrated .DEV assistant",
    "solution_description": "I developed both the frontend and backend of the platform using modern web technologies. The result was a scalable AI-powered builder with responsive design tools, real-time editing, and integrated code generation features. The system supports launching MVPs in less than a day, offering users a fast, intuitive, and professional development experience.",
    "image_main": "blueolive-main.png",
    "image_extra_1": "blueolive-extra1.png",
    "image_extra_2": "blueolive-extra2.png"
  },
  {
    "id": "6",
    "page_heading": "Thrive2go – Website for Invoicing",
    "page_subheading": "Official Marketing Website for Thrive2go App",
    "client_name": "Thrive2go",
    "project_date": "Not Provided",
    "category": "Website Development",
    "location": "Not Provided",
    "project_description": "I designed and developed the official website for Thrive2go, a mobile invoicing and estimates app. The site highlights features such as instant payments, custom templates, AI-powered reminders, and fast invoice creation. Built with a modern stack (HTML, CSS, JS, PHP, Laravel), it's fully responsive, SEO-optimized, and designed to convert visitors into app users.",
    "challenge_description": "The client required a professional and conversion-focused website that showcases the app’s unique invoicing features while driving signups. The challenge was to create a modern, responsive design that communicates trust, speed, and usability to small business owners and freelancers.",
    "challenge_point_1": "Communicate invoicing features like payments, templates, and AI reminders",
    "challenge_point_2": "Responsive, SEO-optimized design for better visibility and usability",
    "challenge_point_3": "Conversion-focused structure to turn visitors into app users",
    "solution_description": "I developed a fast, scalable, and mobile-responsive marketing site that highlights Thrive2go’s key features. The design includes optimized content sections, clear call-to-actions, and app-focused storytelling, ensuring maximum conversions and user engagement.",
    "image_main": "thrive2go-main.png",
    "image_extra_1": "thrive2go-extra1.png",
    "image_extra_2": "thrive2go-extra2.png"
  }
]
